Dlubal.RFEM5.FeMeshRefinement
FE-Mesh refinement parameters

Dlubal.RFEM5.FeMeshRefinement.No
Number

Dlubal.RFEM5.FeMeshRefinement.ID
Identifier

Dlubal.RFEM5.FeMeshRefinement.Comment
Comment

Dlubal.RFEM5.FeMeshRefinement.Tag
Tag

Dlubal.RFEM5.FeMeshRefinement.IsValid
Information if the object is valid or not (read only)

Dlubal.RFEM5.FeMeshRefinement.ObjectList
List of object for which is the refinement defined

Dlubal.RFEM5.FeMeshRefinement.Type
FE-Mesh refinement type

Dlubal.RFEM5.FeMeshRefinement.Number
Number of mesh elements or rows

Dlubal.RFEM5.FeMeshRefinement.Layers
Number of layers

Dlubal.RFEM5.FeMeshRefinement.Length
Half side length / Target FE Length / radius

Dlubal.RFEM5.FeMeshRefinement.TargetLengthInner
Inner target FE Length

Dlubal.RFEM5.FeMeshRefinement.TargetLengthOuter
Outer target FE Length